luc-github/ESP3D/esp8266/webinterface.cpp
#define MSG_SUCCESS(msg) web_interface.add4send(PROGMEM2CHAR(ALERT_SUCCESS));web_interface.add4send(msg);web_interface.add4send(PROGMEM2CHAR(DIV_E));
#define MSG_ERROR(msg) web_interface.add4send(PROGMEM2CHAR(ALERT_ERROR));web_interface.add4send(msg);web_interface.add4send(PROGMEM2CHAR(DIV_E));
#define OPTION(value, selected,content) web_interface.add4send(PROGMEM2CHAR(FORM_OPTION_1));web_interface.add4send(value);web_interface.add4send(PROGMEM2CHAR(FORM_OPTION_2));web_interface.add4send(selected);web_interface.add4send(PROGMEM2CHAR(FORM_OPTION_3));web_interface.add4send(content);web_interface.add4send(PROGMEM2CHAR(FORM_OPTION_4));
#define SELECT_START(id,label,name) web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_1));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_2));web_interface.add4send(label);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_1));web_interface.add4send(name);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_2));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_3));
#define SELECT_START_ERROR(id,label,name) web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_1_ERROR));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_2));web_interface.add4send(label);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_1));web_interface.add4send(name);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_2));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_3));
#define SELECT_END  web_interface.add4send(PROGMEM2CHAR(FORM_SELECT_END));
#define INPUT_TEXT( id,label, name,placeholder,value)  web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_1));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_2));web_interface.add4send(label);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_3));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_4));web_interface.add4send(name);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_5));web_interface.add4send(placeholder);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_6));web_interface.add4send(value);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_7));
#define INPUT_TEXT_ERROR( id,label, name,placeholder,value)  web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_1_ERROR));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_2));web_interface.add4send(label);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_3));web_interface.add4send(id);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_4));web_interface.add4send(name);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_5));web_interface.add4send(placeholder);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_6));web_interface.add4send(value);web_interface.add4send(PROGMEM2CHAR(FORM_INPUT_7));
#define LABEL( title, value)  web_interface.add4send(PROGMEM2CHAR(LABEL_START)); web_interface.add4send(title);web_interface.add4send(PROGMEM2CHAR(LABEL_COLOR));web_interface.add4send(value);web_interface.add4send(PROGMEM2CHAR(LABEL_END));web_interface.add4send(PROGMEM2CHAR(BR));
#define LABEL_UNITS(title, value,units) web_interface.add4send(PROGMEM2CHAR(LABEL_START));  web_interface.add4send(title);web_interface.add4send(PROGMEM2CHAR(LABEL_COLOR));web_interface.add4send(value);web_interface.add4send(units);web_interface.add4send(PROGMEM2CHAR(LABEL_END));web_interface.add4send(PROGMEM2CHAR(BR));
#define TH_ENTRY(entry) web_interface.add4send(PROGMEM2CHAR(TH_S));web_interface.add4send(entry);web_interface.add4send(PROGMEM2CHAR(TH_E));
#define THR_ENTRY(entry) web_interface.add4send(PROGMEM2CHAR(TH_R));web_interface.add4send(entry);web_interface.add4send(PROGMEM2CHAR(TH_E));
#define TD_ENTRY(entry) web_interface.add4send(PROGMEM2CHAR(TD_S));web_interface.add4send(entry);web_interface.add4send(PROGMEM2CHAR(TD_E));

char* ICACHE_FLASH_ATTR strncpy_P(char* dest, const char* src, size_t size) {
    const char* read = src;
    char* write = dest;
    char ch = '.';
    while (size > 0 && ch != '\0')
    {
        ch = pgm_read_byte(read++);
        *write++ = ch;
        size--;
    } 

    return dest;
}

char * progmem2char(const char* src)
{
  static char buffer[300];
  strcpy_P(buffer,src);
  return buffer;
}

//cannot put it in class then cast it as std::function<void(void)> so put outside
void handle_web_interface_root()
{
  String IP;
  String sstatus;
  struct softap_config apconfig;
  struct ip_info info;
   int istatus;
  uint8_t mac [WL_MAC_ADDR_LENGTH];
  if (wifi_get_opmode()==WIFI_STA ) IP=wifi_config.ip2str(WiFi.localIP());
  else IP=wifi_config.ip2str(WiFi.softAPIP());
  web_interface.add4send(PROGMEM2CHAR(PAGE_HEAD_1));
  web_interface.add4send(PROGMEM2CHAR(PAGE_HEAD_2));
  //top bar
  web_interface.add4send(PROGMEM2CHAR(NAV_START));
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART1)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_ELEMENT_ACTIVE)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART2a) );
  web_interface.add4send(IP.c_str());
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART2b));
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART3a));
  web_interface.add4send(IP.c_str());
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART3b));
  web_interface.add4send(PROGMEM2CHAR(NAV_RIGHT_PART)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_END));
 //system part
  web_interface.add4send(PROGMEM2CHAR(PANEL_TOP));
  web_interface.add4send(PROGMEM2CHAR(TITLE_SYSTEM));
  web_interface.add4send(PROGMEM2CHAR(PANEL_START));
  LABEL(PROGMEM2CHAR(CHIP_ID_TITLE),String(system_get_chip_id()).c_str())
  LABEL_UNITS(PROGMEM2CHAR(CPU_FREQ_TITLE),String(system_get_cpu_freq()).c_str(),PROGMEM2CHAR(UNIT_HZ))
  LABEL_UNITS(PROGMEM2CHAR(FREE_MEM_TITLE),String(system_get_free_heap_size()).c_str(),PROGMEM2CHAR(UNIT_OCTET))
  LABEL(PROGMEM2CHAR(SDK_VERSION_TITLE),system_get_sdk_version())
  #ifdef MDNS_FEATURE
  sstatus = PROGMEM2CHAR(HTTP_START);
  sstatus+=PROGMEM2CHAR(LOCAL_NAME);
  LABEL_UNITS(PROGMEM2CHAR(HTTP_MDNS_NAME),sstatus.c_str(),PROGMEM2CHAR(HTTP_END))
  #endif
  istatus = wifi_get_phy_mode();
  if (istatus==PHY_MODE_11B) sstatus=PROGMEM2CHAR(VALUE_11B);
  else if (istatus==PHY_MODE_11G) sstatus=PROGMEM2CHAR(VALUE_11G);
  else sstatus=PROGMEM2CHAR(VALUE_11N);
  LABEL(PROGMEM2CHAR(NETWORK_TITLE),sstatus.c_str())
  istatus = wifi_get_sleep_type();
  if (istatus==NONE_SLEEP_T) sstatus=PROGMEM2CHAR(VALUE_NONE);
  else if (istatus==LIGHT_SLEEP_T) sstatus=PROGMEM2CHAR(VALUE_LIGHT);
  else  sstatus=PROGMEM2CHAR(VALUE_MODEM);
  LABEL(PROGMEM2CHAR(SLEEP_MODE_TITLE),sstatus.c_str())
  //LABEL(sbuf,"Boot mode: ",String(system_get_boot_mode())) //no meaning so far
  LABEL(PROGMEM2CHAR(BOOT_VERSION_TITLE),String(system_get_boot_version()).c_str())
  istatus=0;
  if (!CONFIG::read_buffer(EP_BAUD_RATE,  (byte *)&istatus , BAUD_LENGH))istatus=0;
  LABEL(PROGMEM2CHAR(BAUD_RATE_TITLE),String(istatus).c_str())
  web_interface.add4send(PROGMEM2CHAR(PANEL_END));
 //access point
  web_interface.add4send(PROGMEM2CHAR(PANEL_TOP));
  web_interface.add4send(PROGMEM2CHAR(ACCESS_POINT_TITLE));
  if(wifi_get_opmode()==WIFI_AP ||  wifi_get_opmode()==WIFI_AP_STA) web_interface.add4send(PROGMEM2CHAR(VALUE_ENABLED));
  else web_interface.add4send(PROGMEM2CHAR(VALUE_DISABLED));
  web_interface.add4send(PROGMEM2CHAR(PANEL_START));
  LABEL(PROGMEM2CHAR(MAC_ADDRESS_TITLE),wifi_config.mac2str(WiFi.softAPmacAddress(mac)))
  if (wifi_get_opmode()==WIFI_AP ||  wifi_get_opmode()==WIFI_AP_STA) 
	{
	  if (wifi_softap_get_config(&apconfig))
		{
		  LABEL(PROGMEM2CHAR(SSID_TITLE),(char *)(apconfig.ssid))
		  if(apconfig.ssid_hidden==1)sstatus=PROGMEM2CHAR(VALUE_NO);
		  else sstatus=PROGMEM2CHAR(VALUE_YES);
		  LABEL(PROGMEM2CHAR(VISIBLE_TITLE),sstatus.c_str())
		  LABEL(PROGMEM2CHAR(CHANNEL_TITLE),String(apconfig.channel).c_str())
		  if (apconfig.authmode==AUTH_OPEN)sstatus=PROGMEM2CHAR(VALUE_NONE);
		  else if (apconfig.authmode==AUTH_WEP)sstatus=PROGMEM2CHAR(VALUE_WEP);
		  else if (apconfig.authmode==AUTH_WPA_PSK)sstatus=PROGMEM2CHAR(VALUE_WPA);
		  else if (apconfig.authmode==AUTH_WPA2_PSK)sstatus=PROGMEM2CHAR(VALUE_WPA2);
		  else if (apconfig.authmode==AUTH_WPA_WPA2_PSK)sstatus=PROGMEM2CHAR(VALUE_WPAWPA2);
		  else sstatus=PROGMEM2CHAR(VALUE_MAX); //what is this one ? WPS ? Cannot find information
		  LABEL(PROGMEM2CHAR(AUTENTIFICATION_TITLE),sstatus.c_str())
		  LABEL(PROGMEM2CHAR(MAX_CONNECTION_TITLE),String(apconfig.max_connection).c_str())
		}
		 if (wifi_softap_dhcps_status()==DHCP_STARTED)sstatus=PROGMEM2CHAR(VALUE_STARTED);
		 else sstatus=PROGMEM2CHAR(VALUE_STOPPED);
		 LABEL(PROGMEM2CHAR(DHCP_SERVER_TITLE),sstatus.c_str())
		 if (wifi_get_ip_info(SOFTAP_IF,&info))
			{
			  LABEL(PROGMEM2CHAR(IP_TITLE),wifi_config.ip2str(info.ip.addr))
			  LABEL(PROGMEM2CHAR(GATEWAY_TITLE),wifi_config.ip2str(info.gw.addr))
			  LABEL(PROGMEM2CHAR(SUBNET_TITLE),wifi_config.ip2str(info.netmask.addr))
			}
		//List number of client
		istatus = 0;
		sstatus="";
		struct station_info * station = wifi_softap_get_station_info();
		struct station_info * stationtmp = station;
		//get total number of connected clients
		while(stationtmp)
			{
			istatus++;
			stationtmp = STAILQ_NEXT(stationtmp, next);
			}
		//start table as at least one connected
		 web_interface.add4send(PROGMEM2CHAR(TABLE_START));
		 web_interface.add4send(PROGMEM2CHAR(CAPTION_S));
		 web_interface.add4send(String(istatus).c_str());
		 web_interface.add4send(PROGMEM2CHAR(CONNECTED_STATIONS));
		 web_interface.add4send(PROGMEM2CHAR(CAPTION_E));
		 web_interface.add4send(PROGMEM2CHAR(THEAD_S));
		 web_interface.add4send(PROGMEM2CHAR(TR_S));
		TH_ENTRY(PROGMEM2CHAR(NUMBER_LABEL))
		TH_ENTRY(PROGMEM2CHAR(MAC_LABEL))
		TH_ENTRY(PROGMEM2CHAR(IP_LABEL))
		web_interface.add4send(PROGMEM2CHAR(TR_E));
		web_interface.add4send(PROGMEM2CHAR(THEAD_E));
		web_interface.add4send(PROGMEM2CHAR(TBODY_S));
		istatus=0;
		while(station)
			{
			istatus++;
			//display each client
			 web_interface.add4send(PROGMEM2CHAR(TR_S));
			 THR_ENTRY(String(istatus).c_str())
			 TD_ENTRY(wifi_config.mac2str(station->bssid))
			 //static char ipstr [16];
			 //if (0>sprintf(ipstr, IPSTR,IP2STR(&station->ip))) strcpy (ipstr, "0.0.0.0");
			 TD_ENTRY(wifi_config.ip2str((byte *)&station->ip))
			 web_interface.add4send(PROGMEM2CHAR(TR_E));
			station = STAILQ_NEXT(station, next);
			}
		 web_interface.add4send(PROGMEM2CHAR(TBODY_E));
		//close table
		 web_interface.add4send(PROGMEM2CHAR(TABLE_END));
		 wifi_softap_free_station_info();
	}
  web_interface.add4send(PROGMEM2CHAR(PANEL_END));
  web_interface.add4send(PROGMEM2CHAR(PANEL_TOP));
  web_interface.add4send(PROGMEM2CHAR(STATION_TITLE));
  if(wifi_get_opmode()==WIFI_STA ||  wifi_get_opmode()==WIFI_AP_STA) web_interface.add4send(PROGMEM2CHAR(VALUE_ENABLED));
  else web_interface.add4send(PROGMEM2CHAR(VALUE_DISABLED));
  web_interface.add4send(PROGMEM2CHAR(PANEL_START));
  LABEL(PROGMEM2CHAR(MAC_ADDRESS_TITLE),wifi_config.mac2str(WiFi.macAddress(mac)))
   if(wifi_get_opmode()==WIFI_STA ||  wifi_get_opmode()==WIFI_AP_STA)
   {
	  LABEL(PROGMEM2CHAR(CONNECTION_TO_TITLE),WiFi.SSID())
	  LABEL(PROGMEM2CHAR(CHANNEL_TITLE),String(wifi_get_channel()).c_str())
	  istatus = wifi_station_get_connect_status();
	  if (istatus==STATION_GOT_IP) sstatus=PROGMEM2CHAR(VALUE_CONNECTED);
	  else if  (istatus==STATION_NO_AP_FOUND) sstatus=PROGMEM2CHAR(VALUE_NO_SSID);
	  else if  (istatus==STATION_CONNECT_FAIL) sstatus=PROGMEM2CHAR(VALUE_CONNECTION_FAILED);
	  else if  (istatus==STATION_WRONG_PASSWORD) sstatus=PROGMEM2CHAR(VALUE_CONNECTION_FAILED2);
	  else if  (istatus==STATION_IDLE) sstatus=PROGMEM2CHAR(VALUE_IDLE);//should not happen
	  else sstatus=PROGMEM2CHAR(VALUE_DISCONNECTED);
	  LABEL(PROGMEM2CHAR(STATUS_TITLE),sstatus.c_str())
	  if (wifi_station_dhcpc_status()==DHCP_STARTED)sstatus=PROGMEM2CHAR(VALUE_STARTED);
	  else sstatus=PROGMEM2CHAR(VALUE_STOPPED);
	  LABEL(PROGMEM2CHAR(DHCP_CLIENT_TITLE),sstatus.c_str())
	  LABEL(PROGMEM2CHAR(IP_TITLE),wifi_config.ip2str(WiFi.localIP()))
	  LABEL(PROGMEM2CHAR(GATEWAY_TITLE),wifi_config.ip2str(WiFi.gatewayIP()))
	  LABEL(PROGMEM2CHAR(SUBNET_TITLE),wifi_config.ip2str(WiFi.subnetMask()))
	 }
  web_interface.add4send(PROGMEM2CHAR(PANEL_END));
  web_interface.add4send(PROGMEM2CHAR(PAGE_BOTTOM));
  web_interface.flushbuffer(); 
}

void handle_web_interface_configSys()
{
  String stmp,smsg;
  int istatus=0;
  byte bflag=0;
  bool msg_alert_error=false;
  bool msg_alert_success=false;
  int ibaud=0;
  byte bnetwork=0;
  byte bsleepmode=0;
  //check is it is a submission or a display
  if (web_interface.WebServer.hasArg(PROGMEM2CHAR(SUBMIT_ID)))
  {   //is there a correct list of values?
	  if (web_interface.WebServer.hasArg(PROGMEM2CHAR(BAUD_RATE_ID)) && web_interface.WebServer.hasArg(PROGMEM2CHAR(SLEEP_MODE_ID))&& web_interface.WebServer.hasArg(PROGMEM2CHAR(NETWORK_ID)))
		{   //is each value correct ?
			ibaud  = atoi(web_interface.WebServer.arg(PROGMEM2CHAR(BAUD_RATE_ID)).c_str());
			bnetwork  = atoi(web_interface.WebServer.arg(PROGMEM2CHAR(NETWORK_ID)).c_str());
			bsleepmode = atoi(web_interface.WebServer.arg(PROGMEM2CHAR(SLEEP_MODE_ID)).c_str());
			if (!(ibaud==9600 || ibaud==19200|| ibaud==38400|| ibaud==57600|| ibaud==115200|| ibaud==230400) ||
			    !(bnetwork==PHY_MODE_11B||bnetwork==PHY_MODE_11G||bnetwork==PHY_MODE_11N) ||
			    !(bsleepmode==NONE_SLEEP_T ||bsleepmode==LIGHT_SLEEP_T ||bsleepmode==MODEM_SLEEP_T ))
				{
					msg_alert_error=true;
					smsg=PROGMEM2CHAR(ERROR_QUERY);
			    }
	  }
	  else
	   {
		msg_alert_error=true;
		smsg=PROGMEM2CHAR(ERROR_QUERY);
	   }
	   //if no error apply the changes
		if (msg_alert_error!=true)
			{
			 if(!CONFIG::write_buffer(EP_BAUD_RATE,(const byte *)&ibaud,BAUD_LENGH) ||!CONFIG::write_byte(EP_PHY_MODE,bnetwork) ||!CONFIG::write_byte(EP_SLEEP_MODE,bsleepmode))
				{
					msg_alert_error=true;
					smsg=PROGMEM2CHAR(ERROR_WRITING_CHANGES);
				}
			else
			if (!msg_alert_error)
				{
					msg_alert_success=true;
					smsg=PROGMEM2CHAR(SAVED_CHANGES);
				}
			}
		
