luc-github/ESP3D/esp8266/webinterface.cpp
  }
  if (!CONFIG::read_buffer(EP_BAUD_RATE,  (byte *)&istatus , BAUD_LENGH))istatus=0;
  if (wifi_get_opmode()==WIFI_STA ) stmp=wifi_config.ip2str(WiFi.localIP());
  else stmp=wifi_config.ip2str(WiFi.softAPIP());
  web_interface.add4send(PROGMEM2CHAR(PAGE_HEAD_1));
  web_interface.add4send(PROGMEM2CHAR(PAGE_HEAD_2));
  web_interface.add4send(PROGMEM2CHAR(NAV_START)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART1)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART2a)) ;
  web_interface.add4send(stmp.c_str());
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART2b));
  web_interface.add4send(PROGMEM2CHAR(NAV_ELEMENT_ACTIVE)) ;
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART3a));
  web_interface.add4send(stmp.c_str());
  web_interface.add4send(PROGMEM2CHAR(NAV_LEFT_PART3b));
  web_interface.add4send(PROGMEM2CHAR(NAV_RIGHT_PART));
  web_interface.add4send(PROGMEM2CHAR(NAV_END));
  web_interface.add4send(PROGMEM2CHAR(PANEL_TOP));
  web_interface.add4send(PROGMEM2CHAR(TITLE_SYSTEM));
  web_interface.add4send(PROGMEM2CHAR(PANEL_START));
  web_interface.add4send(PROGMEM2CHAR(FORM_START));
 
  SELECT_START(PROGMEM2CHAR(SYS_1_ID),PROGMEM2CHAR(BAUD_RATE_NAME),PROGMEM2CHAR(BAUD_RATE_ID))
  if (istatus==9600)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_9600), stmp.c_str(),PROGMEM2CHAR(VALUE_9600))
   if (istatus==19200)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_19200), stmp.c_str(),PROGMEM2CHAR(VALUE_19200))
   if (istatus==38400)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_38400), stmp.c_str(),PROGMEM2CHAR(VALUE_38400))
   if (istatus==57600)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_57600), stmp.c_str(),PROGMEM2CHAR(VALUE_57600))
   if (istatus==115200)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_115200), stmp.c_str(),PROGMEM2CHAR(VALUE_115200))
   if (istatus==230400)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(PROGMEM2CHAR(VALUE_230400), stmp.c_str(),PROGMEM2CHAR(VALUE_230400))
  SELECT_END
  
  web_interface.add4send(PROGMEM2CHAR(BR)); 
  
  if (!CONFIG::read_byte(EP_PHY_MODE, &bflag ))bflag=0;
  SELECT_START(PROGMEM2CHAR(SYS_2_ID),PROGMEM2CHAR(NETWORK_NAME),PROGMEM2CHAR(NETWORK_ID))
  if (bflag==PHY_MODE_11B)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11B).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11B))
  if (bflag==PHY_MODE_11G)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(PHY_MODE_11G).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11G))
  if (bflag==PHY_MODE_11N)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  if (wifi_get_opmode()==WIFI_STA )
	{
		OPTION(String(PHY_MODE_11N).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_11N))
	}
  SELECT_END
  
  web_interface.add4send(PROGMEM2CHAR(BR)); 
  
  if (!CONFIG::read_byte(EP_SLEEP_MODE, &bflag ))bflag=0;
  SELECT_START(PROGMEM2CHAR(SYS_3_ID),PROGMEM2CHAR(SLEEP_MODE_NAME),PROGMEM2CHAR(SLEEP_MODE_ID))
  if (bflag==NONE_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(NONE_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_NONE))
  if (bflag==LIGHT_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(LIGHT_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_LIGHT))
  if (bflag==MODEM_SLEEP_T)stmp = PROGMEM2CHAR(VALUE_SELECTED);
  else stmp="";
  OPTION(String(MODEM_SLEEP_T).c_str(), stmp.c_str(),PROGMEM2CHAR(VALUE_MODEM))
  SELECT_END
  
  web_interface.add4send(PROGMEM2CHAR(FORM_SUBMIT)); 
  web_interface.add4send(PROGMEM2CHAR(FORM_END));
  web_interface.add4send(PROGMEM2CHAR(PANEL_END)); 
  if(msg_alert_error) 
	{
		MSG_ERROR(smsg.c_str()) 
	}
if(msg_alert_success) 
	{
		MSG_SUCCESS(smsg.c_str()) 
	}
  web_interface.add4send(PROGMEM2CHAR(PAGE_BOTTOM));
  web_interface.flushbuffer();
  if (msg_alert_success && !msg_alert_error)
	{
		system_restart();
	}
}

void handle_not_found()
{
  String IP;
  if (wifi_get_opmode()==WIFI_STA ) IP=wifi_config.ip2str(WiFi.localIP());
  else IP=wifi_config.ip2str(WiFi.softAPIP());
	 web_interface.add4send(PROGMEM2CHAR(T404_PAGE));
	 web_interface.add4send(IP.c_str());
	 web_interface.add4send(PROGMEM2CHAR(T404_PAGE_2));
	 web_interface.flushbuffer();
}

//URI Decoding function 
//no check if dst buffer is big enough to receive string so 
//use same size as src is a recommendation
void WEBINTERFACE_CLASS::urldecode(char *dst, const char *src)
{
  char a, b;
  if (dst==NULL) return;
  while (*src) {
    if ((*src == '%') &&
      ((a = src[1]) && (b = src[2])) &&
      (isxdigit(a) && isxdigit(b))) {
      if (a >= 'a')
        a -= 'a'-'A';
      if (a >= 'A')
        a -= ('A' - 10);
      else
        a -= '0';
      if (b >= 'a')
        b -= 'a'-'A';
      if (b >= 'A')
        b -= ('A' - 10);
      else
        b -= '0';
      *dst++ = 16*a+b;
      src+=3;
    } 
    else {
      *dst++ = *src++;
    }
  }
  *dst++ = '\0';
}

//send immediatly the current data
void WEBINTERFACE_CLASS::flushbuffer()
{   //empty buffer
	 web_interface.add4send("", true);
	 //reset header part
	 bsendingstarted=false;
}

//check size of buffer 
//add to buffer if under buffer limit
//send if buffer limit is reached or will be reached
void WEBINTERFACE_CLASS::add4send(const char * data2send, bool bimmediatsend)
{
	//we store as no need to send right now
	if (((buffer2send.length() + strlen(data2send)) <LIMIT_BUFFER) && !bimmediatsend)
		{
			buffer2send = buffer2send + data2send;
		}
	else //or buffer is over or need immediate
		{//send current buffer first
		  if(!bsendingstarted)
			{ //no header send so first send using header 2500 limit allow to add extra without calculation
				web_interface.WebServer.send(200, "text/html", buffer2send);
				bsendingstarted=true;
			}
		 else
			{ //direct data send
				web_interface.WebServer.sendContent(buffer2send);
			}
		buffer2send=data2send;
		//do we need to purge or to store ?
		if (bimmediatsend)
			{//if some data flush
				if (buffer2send.length()>0)
					{
					web_interface.WebServer.sendContent(buffer2send);
					//reset buffer
					buffer2send="";
					}
			//reset header
			bsendingstarted=false;
			}
		}
}

//constructor
WEBINTERFACE_CLASS::WEBINTERFACE_CLASS (int port):WebServer(port)
{
  //init what will handle "/"
  WebServer.on("/",HTTP_ANY, handle_web_interface_root);
  WebServer.on("/CONFIGSYS",HTTP_ANY, handle_web_interface_configSys);
  WebServer.onNotFound( handle_not_found);
  buffer2send="";
}

WEBINTERFACE_CLASS web_interface(80);

